## Staging: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_wafv2_regex_pattern_set.re_api will be created
  + resource "aws_wafv2_regex_pattern_set" "re_api" {
      + arn         = (known after apply)
      + description = "Regex matching valid api endpoints"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "re_api"
      + scope       = "REGIONAL"
      + tags        = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all    = {
          + "CostCenter" = "notification-canada-ca-staging"
        }

      + regular_expression {
          + regex_string = "/_status.*|/api-key.*|/complaint.*|/email-branding.*|/events.*|/inbound-number.*|/invite.*|/letter-branding.*|/letters.*"
        }
      + regular_expression {
          + regex_string = "/notifications.*|/organisation.*|/organisations.*|/platform-stats.*|/provider-details.*|/service.*|/static.*|/user.*|/v2.*"
        }
    }

  # aws_wafv2_web_acl.api_lambda will be updated in-place
  ~ resource "aws_wafv2_web_acl" "api_lambda" {
        id         = "24e77018-6b08-41e8-8d1b-de9f5e46fd69"
        name       = "api-lambda-waf"
        tags       = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (5 unchanged attributes hidden)


      + rule {
          + name     = "api_invalid_path"
          + priority = 11

          + action {

              + count {
                }
            }

          + statement {
              + and_statement {
                  + statement {

                      + not_statement {
                          + statement {

                              + regex_pattern_set_reference_statement {
                                  + arn = (known after apply)

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                  + statement {

                      + not_statement {
                          + statement {

                              + byte_match_statement {
                                  + positional_constraint = "EXACTLY"
                                  + search_string         = "/"

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 0
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "api_invalid_path"
              + sampled_requests_enabled   = true
            }
        }

        # (10 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.re_api"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

35 tests, 17 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
